#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Splash

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Splash.Splash_C.ExecuteUbergraph_Splash
// 0x0038 (0x0038 - 0x0000)
struct Splash_C_ExecuteUbergraph_Splash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTsSplash_C*                            CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoopEvent_FinishLoopState;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Splash_C_ExecuteUbergraph_Splash) == 0x000008, "Wrong alignment on Splash_C_ExecuteUbergraph_Splash");
static_assert(sizeof(Splash_C_ExecuteUbergraph_Splash) == 0x000038, "Wrong size on Splash_C_ExecuteUbergraph_Splash");
static_assert(offsetof(Splash_C_ExecuteUbergraph_Splash, EntryPoint) == 0x000000, "Member 'Splash_C_ExecuteUbergraph_Splash::EntryPoint' has a wrong offset!");
static_assert(offsetof(Splash_C_ExecuteUbergraph_Splash, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Splash_C_ExecuteUbergraph_Splash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Splash_C_ExecuteUbergraph_Splash, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Splash_C_ExecuteUbergraph_Splash::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Splash_C_ExecuteUbergraph_Splash, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'Splash_C_ExecuteUbergraph_Splash::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Splash_C_ExecuteUbergraph_Splash, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'Splash_C_ExecuteUbergraph_Splash::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Splash_C_ExecuteUbergraph_Splash, CallFunc_LoopEvent_FinishLoopState) == 0x000030, "Member 'Splash_C_ExecuteUbergraph_Splash::CallFunc_LoopEvent_FinishLoopState' has a wrong offset!");

}

