#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Splash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Splash_0_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Splash.Splash_C
// 0x0038 (0x02E8 - 0x02B0)
class ASplash_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTsSplash_C*                            Splash;                                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NewVar_1;                                          // 0x02C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LoopGap;                                           // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271C[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSplash                                __L;                                               // 0x02D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void __I___0();
	void __I___1();
	void ExecuteUbergraph_Splash(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Splash_C">();
	}
	static class ASplash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASplash_C>();
	}
};
static_assert(alignof(ASplash_C) == 0x000008, "Wrong alignment on ASplash_C");
static_assert(sizeof(ASplash_C) == 0x0002E8, "Wrong size on ASplash_C");
static_assert(offsetof(ASplash_C, UberGraphFrame) == 0x0002B0, "Member 'ASplash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASplash_C, Splash) == 0x0002B8, "Member 'ASplash_C::Splash' has a wrong offset!");
static_assert(offsetof(ASplash_C, NewVar_1) == 0x0002C0, "Member 'ASplash_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(ASplash_C, LoopGap) == 0x0002C8, "Member 'ASplash_C::LoopGap' has a wrong offset!");
static_assert(offsetof(ASplash_C, __L) == 0x0002D0, "Member 'ASplash_C::__L' has a wrong offset!");

}

