#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TapLogin

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "TapLogin_structs.hpp"
#include "SlateCore_classes.hpp"


namespace SDK
{

// Class TapLogin.PermissionCheckBoxWidgetStyle
// 0x0870 (0x08A8 - 0x0038)
class UPermissionCheckBoxWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FPermissionCheckBoxStyle               WidgetStyle;                                       // 0x0038(0x0870)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PermissionCheckBoxWidgetStyle">();
	}
	static class UPermissionCheckBoxWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPermissionCheckBoxWidgetStyle>();
	}
};
static_assert(alignof(UPermissionCheckBoxWidgetStyle) == 0x000008, "Wrong alignment on UPermissionCheckBoxWidgetStyle");
static_assert(sizeof(UPermissionCheckBoxWidgetStyle) == 0x0008A8, "Wrong size on UPermissionCheckBoxWidgetStyle");
static_assert(offsetof(UPermissionCheckBoxWidgetStyle, WidgetStyle) == 0x000038, "Member 'UPermissionCheckBoxWidgetStyle::WidgetStyle' has a wrong offset!");

// Class TapLogin.QrCodeScanTipButtonWidgetStyle
// 0x0440 (0x0478 - 0x0038)
class UQrCodeScanTipButtonWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FQrCodeScanTipButtonStyle              WidgetStyle;                                       // 0x0038(0x0440)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"QrCodeScanTipButtonWidgetStyle">();
	}
	static class UQrCodeScanTipButtonWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQrCodeScanTipButtonWidgetStyle>();
	}
};
static_assert(alignof(UQrCodeScanTipButtonWidgetStyle) == 0x000008, "Wrong alignment on UQrCodeScanTipButtonWidgetStyle");
static_assert(sizeof(UQrCodeScanTipButtonWidgetStyle) == 0x000478, "Wrong size on UQrCodeScanTipButtonWidgetStyle");
static_assert(offsetof(UQrCodeScanTipButtonWidgetStyle, WidgetStyle) == 0x000038, "Member 'UQrCodeScanTipButtonWidgetStyle::WidgetStyle' has a wrong offset!");

// Class TapLogin.TULoginReflection
// 0x0000 (0x0030 - 0x0030)
class UTULoginReflection final : public UObject
{
public:
	static class FString GetOpenID();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TULoginReflection">();
	}
	static class UTULoginReflection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTULoginReflection>();
	}
};
static_assert(alignof(UTULoginReflection) == 0x000008, "Wrong alignment on UTULoginReflection");
static_assert(sizeof(UTULoginReflection) == 0x000030, "Wrong size on UTULoginReflection");

// Class TapLogin.TapLoginWidgetStyle
// 0x2960 (0x2998 - 0x0038)
class UTapLoginWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FTapLoginStyle                         WidgetStyle;                                       // 0x0038(0x2960)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TapLoginWidgetStyle">();
	}
	static class UTapLoginWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTapLoginWidgetStyle>();
	}
};
static_assert(alignof(UTapLoginWidgetStyle) == 0x000008, "Wrong alignment on UTapLoginWidgetStyle");
static_assert(sizeof(UTapLoginWidgetStyle) == 0x002998, "Wrong size on UTapLoginWidgetStyle");
static_assert(offsetof(UTapLoginWidgetStyle, WidgetStyle) == 0x000038, "Member 'UTapLoginWidgetStyle::WidgetStyle' has a wrong offset!");

}

