#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TapUpdate

#include "Basic.hpp"


namespace SDK::Params
{

// Function TapUpdate.TapUpdateStaticLibrary.Init
// 0x0020 (0x0020 - 0x0000)
struct TapUpdateStaticLibrary_Init final
{
public:
	class FString                                 ClientId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ClientToken;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TapUpdateStaticLibrary_Init) == 0x000008, "Wrong alignment on TapUpdateStaticLibrary_Init");
static_assert(sizeof(TapUpdateStaticLibrary_Init) == 0x000020, "Wrong size on TapUpdateStaticLibrary_Init");
static_assert(offsetof(TapUpdateStaticLibrary_Init, ClientId) == 0x000000, "Member 'TapUpdateStaticLibrary_Init::ClientId' has a wrong offset!");
static_assert(offsetof(TapUpdateStaticLibrary_Init, ClientToken) == 0x000010, "Member 'TapUpdateStaticLibrary_Init::ClientToken' has a wrong offset!");

// Function TapUpdate.TapUpdateStaticLibrary.UpdateGame
// 0x0014 (0x0014 - 0x0000)
struct TapUpdateStaticLibrary_UpdateGame final
{
public:
	TDelegate<void()>                             Handle;                                            // 0x0000(0x0014)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TapUpdateStaticLibrary_UpdateGame) == 0x000004, "Wrong alignment on TapUpdateStaticLibrary_UpdateGame");
static_assert(sizeof(TapUpdateStaticLibrary_UpdateGame) == 0x000014, "Wrong size on TapUpdateStaticLibrary_UpdateGame");
static_assert(offsetof(TapUpdateStaticLibrary_UpdateGame, Handle) == 0x000000, "Member 'TapUpdateStaticLibrary_UpdateGame::Handle' has a wrong offset!");

}

