#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsSplash

#include "Basic.hpp"


namespace SDK::Params
{

// Function TsSplash.TsSplash_C.Init
// 0x0008 (0x0008 - 0x0000)
struct TsSplash_C_Init final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsSplash_C_Init) == 0x000008, "Wrong alignment on TsSplash_C_Init");
static_assert(sizeof(TsSplash_C_Init) == 0x000008, "Wrong size on TsSplash_C_Init");
static_assert(offsetof(TsSplash_C_Init, WorldContext) == 0x000000, "Member 'TsSplash_C_Init::WorldContext' has a wrong offset!");

// Function TsSplash.TsSplash_C.LoopEvent
// 0x0008 (0x0008 - 0x0000)
struct TsSplash_C_LoopEvent final
{
public:
	float                                         Gap;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FinishLoopState;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TsSplash_C_LoopEvent) == 0x000004, "Wrong alignment on TsSplash_C_LoopEvent");
static_assert(sizeof(TsSplash_C_LoopEvent) == 0x000008, "Wrong size on TsSplash_C_LoopEvent");
static_assert(offsetof(TsSplash_C_LoopEvent, Gap) == 0x000000, "Member 'TsSplash_C_LoopEvent::Gap' has a wrong offset!");
static_assert(offsetof(TsSplash_C_LoopEvent, FinishLoopState) == 0x000004, "Member 'TsSplash_C_LoopEvent::FinishLoopState' has a wrong offset!");

// Function TsSplash.TsSplash_C.GetDelay
// 0x0004 (0x0004 - 0x0000)
struct TsSplash_C_GetDelay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TsSplash_C_GetDelay) == 0x000004, "Wrong alignment on TsSplash_C_GetDelay");
static_assert(sizeof(TsSplash_C_GetDelay) == 0x000004, "Wrong size on TsSplash_C_GetDelay");
static_assert(offsetof(TsSplash_C_GetDelay, ReturnValue) == 0x000000, "Member 'TsSplash_C_GetDelay::ReturnValue' has a wrong offset!");

}

